## Marketing analysis:
### We have 2 file for 2 different month

In [128]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
%%time
n_data = pd.read_csv('D:/datasets/2019-Nov.csv')

Wall time: 2min 12s

In [3]:
%%time 
df = pd.read_csv('D:/datasets/2019-Oct.csv', chunksize=10000)
o_data = pd.concat([chunk for chunk in df])

Wall time: 2min 12s

In [4]:
o_data.shape

(42448764, 9)

In [5]:
%%time
df = o_data.append(n_data, ignore_index=True, sort=False)

Wall time: 1min 50s

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109950743 entries, 0 to 109950742
Data columns (total 9 columns):
 #   Column         Dtype
---  ------         -----
 0   event_time     object
 1   event_type     object
 2   product_id     int64
 3   category_id    int64
 4   category_code  object
 5   brand          object
 6   price          float64
 7   user_id        int64
 8   user_session   object
dtypes: float64(1), int64(3), object(5)
memory usage: 7.4+ GB

In [7]:
df.drop(columns=['product_id','category_id', 'user_id','user_session'], axis='columns', inplace=True)

In [8]:
df = df.dropna()

In [9]:
df.isnull().sum()

event_time       0
event_type       0
category_code    0
brand            0
price            0
dtype: int64

In [10]:
df['event_type'].unique()

array(['view', 'purchase', 'cart'], dtype=object)

In [11]:
df['brand'].value_counts()

samsung         12892231
apple           10306554
xiaomi           6835756
huawei           2476500
lg               1533250
                  ...
ekobike                1
ismart                 1
vigoole                1
luciasvetlaa           1
powerplant             1
Name: brand, Length: 2044, dtype: int64

In [12]:
df = df.set_index(pd.DatetimeIndex([x.split(' ')[0] for x in df['event_time']]))
df['time'] = [x.split(' ')[1] for x in df['event_time']]
df.drop('event_time', inplace=True, axis='columns')

In [20]:
df.loc['2019-11-30':, ]

,event_type,category_code,brand,price,time
2019-11-30,view,electronics.audio.headphone,apple,196.27,00:00:00
2019-11-30,view,electronics.smartphone,apple,952.15,00:00:00
2019-11-30,view,appliances.kitchen.washer,beko,215.89,00:00:01
2019-11-30,view,computers.components.cpu,intel,203.87,00:00:02
2019-11-30,view,auto.accessories.alarm,centurion,82.11,00:00:03
...,...,...,...,...,...
2019-11-30,view,construction.tools.drill,bosch,266.16,23:59:57
2019-11-30,view,apparel.shoes,baden,62.81,23:59:58
2019-11-30,view,electronics.smartphone,samsung,167.03,23:59:59
2019-11-30,view,appliances.kitchen.refrigerators,samsung,566.27,23:59:59
2019-11-30,view,electronics.smartphone,apple,1312.52,23:59:59

In [31]:
df.drop_duplicates()

,event_type,category_code,brand,price,time
2019-10-01,view,appliances.environment.water_heater,aqua,33.20,00:00:00
2019-10-01,view,computers.notebook,lenovo,251.74,00:00:01
2019-10-01,view,electronics.smartphone,apple,1081.98,00:00:04
2019-10-01,view,computers.desktop,pulser,908.62,00:00:05
2019-10-01,view,apparel.shoes.keds,baden,102.71,00:00:10
...,...,...,...,...,...
2019-11-30,view,construction.tools.drill,bosch,266.16,23:59:57
2019-11-30,view,apparel.shoes,baden,62.81,23:59:58
2019-11-30,view,electronics.smartphone,samsung,167.03,23:59:59
2019-11-30,view,appliances.kitchen.refrigerators,samsung,566.27,23:59:59
2019-11-30,view,electronics.smartphone,apple,1312.52,23:59:59

In [47]:
df.sort_values(by='price',ascending=False).groupby(['brand', 'price']).size()

brand     price
a-elita   8.49     203
          17.76     28
          73.28    290
aardwolf  8.98      19
          13.73     16
                  ...
zwerg     11.36      4
          33.89      1
          34.06      6
          35.05      2
          35.23      5
Length: 192073, dtype: int64

## This is sample of 15 best brand 11 code below:

In [53]:
sample = df.iloc[:10000, :]

In [109]:
sample = sample.sort_values(by='price', ascending=False)

In [58]:
sample

           event_type                category_code    brand    price      time
2019-10-01       view           electronics.clocks     rado  2574.07  02:26:24
2019-10-01       view           computers.notebook      msi  2574.04  02:37:24
2019-10-01       view           computers.notebook      msi  2574.04  02:45:48
2019-10-01       view         electronics.video.tv       lg  2574.04  02:42:21
2019-10-01       view         electronics.video.tv     sony  2574.04  02:42:42
...               ...                          ...      ...      ...       ...
2019-10-01       view     construction.tools.light   lezard     2.73  02:43:21
2019-10-01       view            kids.fmcg.diapers  huggies     2.63  02:20:40
2019-10-01       view  electronics.audio.headphone   ritmix     0.88  02:25:11
2019-10-01       view  electronics.audio.headphone   ritmix     0.88  02:25:40
2019-10-01   purchase  electronics.audio.headphone   ritmix     0.88  02:26:05

[10000 rows x 5 columns]

In [71]:
best_brand = sample.groupby(['price', 'brand'])['category_code'].min()

In [110]:
best_time = sample.groupby(['price', 'brand'], as_index=False)['time'].max()

In [111]:
best_time.sort_values(by='price', ascending=False, inplace=True)

In [112]:
best_time.iloc[:100, ]

        price     brand      time
2654  2574.07      rado  02:26:24
2653  2574.04      sony  02:42:42
2652  2574.04       msi  02:45:48
2651  2574.04        lg  02:42:21
2650  2573.81      sony  02:43:13
...       ...       ...       ...
2559  1364.00     apple  02:43:05
2558  1352.42     apple  02:29:03
2557  1351.36     bosch  02:27:43
2556  1335.79     apple  02:21:21
2555  1328.22  longines  02:24:12

[100 rows x 3 columns]

In [113]:
common_brand_best_time = best_time['brand'].value_counts()

In [120]:
list_top_brand = ['samsung', 'xiaomi', 'apple', 'hp', 'casio', 'lenovo', 'huawei',
       'bosch', 'lg', 'acer', 'asus', 'nokia', 'sony', 'redmond', 'dauscher']

In [130]:
best_time['brand'] = [x if x in list_top_brand else np.nan for x in best_time['brand']]

In [132]:
best_time.dropna()

        price    brand      time
2653  2574.04     sony  02:42:42
2651  2574.04       lg  02:42:21
2650  2573.81     sony  02:43:13
2649  2573.55     sony  02:43:39
2647  2552.93     acer  02:45:21
...       ...      ...       ...
27       7.70       hp  02:44:23
23       6.85   xiaomi  02:32:10
19       6.67  samsung  02:28:16
20       6.67   xiaomi  01:34:36
12       5.92     sony  02:36:03

[985 rows x 3 columns]

## 15 most common thing that people buy in which brand:

In [138]:
common_things = sample['category_code'].value_counts()[:15]

In [139]:
sample['category_code'] = [x if x in common_things else np.nan for x in sample['category_code']]

In [142]:
common_brand = sample['brand'].value_counts()[:15]

In [143]:
sample['brand'] = [x if x in common_brand else np.nan for x in sample['brand']]

In [146]:
sample.dropna(inplace=True)

In [148]:
new_sample = sample

In [152]:
new_sample.set_index('time', inplace=True)

In [155]:
new_sample.sort_index(inplace=True)

In [156]:
new_sample

         event_type                      category_code     brand    price
time
00:00:01       view                 computers.notebook    lenovo   251.74
00:00:04       view             electronics.smartphone     apple  1081.98
00:00:11       view             electronics.smartphone   samsung   900.64
00:00:11       view             electronics.smartphone    huawei   566.01
00:00:19       view                 computers.notebook        hp   580.89
...             ...                                ...       ...      ...
02:48:05       view  appliances.environment.air_heater  elenberg    33.44
02:48:05       view             electronics.smartphone    huawei   278.55
02:48:06       view             electronics.smartphone   samsung   253.36
02:48:07       view          appliances.kitchen.washer        lg   339.75
02:48:07       view                 computers.notebook    xiaomi  1127.18

[5770 rows x 4 columns]

In [161]:
new_sample['01:25:00':'02:25:00']['event_type'] = 'purches'

<ipython-input-161-b6a9d5529eb3>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_sample['01:25:00':'02:25:00']['event_type'] = 'purches'

In [163]:
new_sample['01:25:00':'02:25:00']

         event_type           category_code    brand    price
time
01:26:09    purches  electronics.smartphone   xiaomi   234.67
01:26:27    purches  electronics.smartphone    apple  1052.79
01:26:45    purches  electronics.smartphone    apple  1415.48
01:28:15    purches  electronics.smartphone  samsung   154.42
01:33:10    purches  electronics.smartphone  samsung   154.42
...             ...                     ...      ...      ...
02:24:59    purches  electronics.smartphone    apple   587.52
02:24:59    purches  electronics.smartphone  samsung   130.76
02:25:00    purches  electronics.smartphone   huawei    95.11
02:25:00    purches  electronics.smartphone   xiaomi   395.10
02:25:00    purches  electronics.smartphone    apple   981.54

[1004 rows x 4 columns]

In [244]:
update_price = new_sample['01:25:00':'02:25:00']['price'].agg(lambda x: round(x*25/100))
new_sample.replace(to_replace=new_sample['01:25:00':'02:25:00']['price'].values, value=update_price, inplace=True)

In [245]:
new_sample['01:25:00':'02:25:00']

         event_type           category_code    brand  price
time
01:26:09    purches  electronics.smartphone   xiaomi   59.0
01:26:27    purches  electronics.smartphone    apple  263.0
01:26:45    purches  electronics.smartphone    apple  354.0
01:28:15    purches  electronics.smartphone  samsung   39.0
01:33:10    purches  electronics.smartphone  samsung   39.0
...             ...                     ...      ...    ...
02:24:59    purches  electronics.smartphone    apple  147.0
02:24:59    purches  electronics.smartphone  samsung   33.0
02:25:00    purches  electronics.smartphone   huawei   24.0
02:25:00    purches  electronics.smartphone   xiaomi   99.0
02:25:00    purches  electronics.smartphone    apple  245.0

[1004 rows x 4 columns]